# Load Libraries/Data

In [1]:
## Standard Imports
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats
## Importing the OS and JSON Modules
import os, json

import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

import warnings
warnings.filterwarnings('ignore')

# Load JSON File

In [2]:
with open("Data/Mock_Crowdsourcing_API_Results.json") as f:
    jsondata = json.load(f)
type(jsondata)

dict

- to use a json file use "with open" 
- "as f:" we are reading the files  
- type = dictionary

# Extract

In [3]:
## explore each key
jsondata.keys()

dict_keys(['meta', 'data'])

In [4]:
## display meta
jsondata ['meta']

'Practice Lesson: Mock API Call'

- 'meta' only includes "Practice Lesson: Mock API Call"

In [5]:
## display data
type (jsondata['data'])

dict

In [6]:
## preview the dictionary
jsondata ['data'].keys()

dict_keys(['crowd', 'demographics', 'financials', 'use'])

- it shows we have 4 keys here

In [7]:
## what does the crowd key look like?
type(jsondata['data']['crowd'])

list

In [8]:
## checking single entry of crowd
jsondata ['data']['crowd'][:2]

[{'id': 658776,
  'posted_time': '2014-01-17 21:21:10+00:00',
  'funded_time': '2014-02-05 17:57:55+00:00',
  'lender_count': 33},
 {'id': 1314847,
  'posted_time': '2017-06-07 02:02:41+00:00',
  'funded_time': '2017-06-21 17:10:38+00:00',
  'lender_count': 9}]

- you can see it is store in a list.

In [9]:
## making crowd a dataframe
crowd = pd.DataFrame (jsondata ['data']['crowd'])
crowd

,id,posted_time,funded_time,lender_count
0,658776,2014-01-17 21:21:10+00:00,2014-02-05 17:57:55+00:00,33
1,1314847,2017-06-07 02:02:41+00:00,2017-06-21 17:10:38+00:00,9
2,863063,2015-03-27 20:08:04+00:00,2015-04-04 15:01:22+00:00,1
3,1184347,2016-11-14 07:32:12+00:00,2016-11-25 03:07:13+00:00,47
4,729745,2014-06-24 07:35:46+00:00,2014-07-10 16:12:43+00:00,12
...,...,...,...,...
9995,679499,2014-03-05 07:05:38+00:00,2014-03-13 01:01:41+00:00,11
9996,873525,2015-04-22 06:32:13+00:00,None,6
9997,917686,2015-07-15 11:53:33+00:00,2015-08-14 11:45:40+00:00,44
9998,905789,2015-06-22 07:44:18+00:00,2015-07-14 00:20:45+00:00,11
9999,1216411,2017-01-06 06:54:07+00:00,2017-01-08 01:17:28+00:00,1

In [10]:
## making demographics a dataframe
demo = pd.DataFrame(jsondata['data']['demographics'])
demo

,id,country,region,borrower_genders
0,658776,El Salvador,Ciudad El Triunfo,male
1,1314847,Philippines,"Bais, Negros Oriental",female
2,863063,Peru,Huarochiri,"female, female, female, female, female, female..."
3,1184347,Armenia,Vanadzor town,female
4,729745,Uganda,Masindi,female
...,...,...,...,...
9995,679499,Pakistan,Lahore,female
9996,873525,Kenya,Machakos,"male, male, female, female, male"
9997,917686,Senegal,None,"female, female"
9998,905789,Philippines,"Binalbagan, Negros Occidental",female
9999,1216411,Philippines,"Carmen, Bohol",female

In [11]:
## making financials a dataframe
financials = pd.DataFrame(jsondata['data']['financials'])
financials

           id funded_amount currency  term_in_months
0      658776       $1000.0      USD            20.0
1     1314847        $225.0      PHP            13.0
2      863063       $1150.0      PEN             6.0
3     1184347       $1700.0      AMD            26.0
4      729745        $400.0      UGX             8.0
...       ...           ...      ...             ...
9995   679499         400.0      PKR            12.0
9996   873525         375.0      KES            14.0
9997   917686        1375.0      XOF             8.0
9998   905789         450.0      PHP            13.0
9999  1216411         125.0      PHP            16.0

[10000 rows x 4 columns]

In [12]:
## making use a dataframe
use = pd.DataFrame(jsondata['data']['use'])
use

,id,activity,sector,use
0,658776,Vehicle,Personal Use,to purchase a motorcycle in order to travel fr...
1,1314847,Pigs,Agriculture,to buy feed and other supplies like vitamins t...
2,863063,Bookstore,Retail,"to buy notebooks, pencils, and pens."
3,1184347,Photography,Services,to pay for a new lens for providing photograph...
4,729745,Fuel/Firewood,Retail,to buy firewood to sell.
...,...,...,...,...
9995,679499,Fruits & Vegetables,Food,to help her husband buy onions for resale.
9996,873525,Farming,Agriculture,to buy fertilizer and pesticides to boost his ...
9997,917686,Fish Selling,Food,buy fish
9998,905789,General Store,Retail,to buy more groceries to sell.
9999,1216411,Personal Housing Expenses,Housing,"to buy cement, hollow blocks, GI sheets, sand,..."

# Transform

- Remove '$' From 'funded_amount' in financials Data
- Change to numeric

In [13]:
financials.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              10000 non-null  int64
 1   funded_amount   10000 non-null  object
 2   currency        10000 non-null  object
 3   term_in_months  10000 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 312.6+ KB

- funded_amount object (so we need to remove the dollar sign)
- fix it as an int. column

In [14]:
## fixing funded amount column
financials ['funded_amount'] = financials ['funded_amount'].str.replace('$','').astype(float)
financials

           id  funded_amount currency  term_in_months
0      658776         1000.0      USD            20.0
1     1314847          225.0      PHP            13.0
2      863063         1150.0      PEN             6.0
3     1184347         1700.0      AMD            26.0
4      729745          400.0      UGX             8.0
...       ...            ...      ...             ...
9995   679499          400.0      PKR            12.0
9996   873525          375.0      KES            14.0
9997   917686         1375.0      XOF             8.0
9998   905789          450.0      PHP            13.0
9999  1216411          125.0      PHP            16.0

[10000 rows x 4 columns]

- we are putting or overwriting into the financial funded  account

# Load JSON File

- Create a database with SQAlchamy
- Add the tables to the database

In [15]:
connection_str = "mysql+pymysql://root:password@localhost/Mock_Exam"

In [16]:
## creating connection to database with sqlalchemy
## only if using special directors in my password
engine = create_engine(connection_str)

In [17]:
# only if need create_database(connection_str)

In [18]:
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

## Upload DataFrames as Tables

In [19]:
crowd.to_sql('crowd', engine, if_exists = 'replace')

10000

In [20]:
demo.to_sql('demographics', engine, if_exists = 'replace')

10000

In [21]:
financials.to_sql('financials', engine, if_exists = 'replace')

10000

In [22]:
use.to_sql('use', engine, if_exists = 'replace')

10000

## SQL Query "Show Tables;" for Database

In [23]:
q = """

SHOW TABLES;

"""

pd.read_sql(q, engine)

  Tables_in_mock_exam
0               crowd
1        demographics
2          financials
3                 use